🎈**네트워크란?**

네트워크 통신은 컴퓨터나 다른 전자 기기 간에 데이터를 주고받는 과정입니다. 이 과정은 두 가지 주요 요소, 즉 **하드웨어**와 **소프트웨어**에 의해 이루어집니다. 하드웨어는 물리적 장비를, 소프트웨어는 통신을 제어하고 관리하는 프로그램을 포함합니다.

- **하드웨어**: 네트워크 장비와 케이블 (RJ-45 / LAN 케이블)
- **소프트웨어**: 운영체제, 네트워크 프로토콜, 애플리케이션

네트워크 통신의 핵심은 데이터를 패킷 단위로 나누어 송수신하는 것입니다. 이 데이터 패킷은 목적지까지 도달할 때까지 여러 경로를 거칠 수 있습니다.

🏷️**네트워크 장비**

네트워크 장비를 서로 연결하는 케이블과 케이블을 기기에 연결할 수 있게 하는 장치

1. **RJ-45**
    - **RJ-45**는 네트워크 케이블의 일종으로, 주로 **이더넷(Ethernet)** 네트워크에서 사용됩니다.
    - **구성**: 8개의 핀이 있는 커넥터로, 이 핀을 통해 데이터와 전원 신호를 전달합니다.
    - **용도**: 주로 LAN(Local Area Network)에서 컴퓨터를 라우터, 스위치, 허브와 연결하는 데 사용됩니다.
2. **LAN 케이블**
    - **LAN 케이블**은 RJ-45 커넥터를 사용하여 네트워크 장비를 연결하는 유선 케이블입니다.
    - **유형**: 주로 **카테고리 5e (Cat 5e)**, **카테고리 6 (Cat 6)**, **카테고리 6a (Cat 6a)**, **카테고리 7 (Cat 7)** 케이블이 사용됩니다.
        - **Cat 5e**: 최대 1000 Mbps의 속도와 100m의 거리까지 지원.
        - **Cat 6**: 최대 10 Gbps의 속도와 55m의 거리까지 지원.
        - **Cat 6a**: 최대 10 Gbps의 속도와 100m의 거리까지 지원.
        - **Cat 7**: 최대 10 Gbps의 속도와 100m의 거리까지 지원하며, 더 높은 차단 성능을 제공합니다.

네트워크 망 관리 업무뿐만 아니라, 나는 부대에서 사무실 구성/네트워크 단말기 오류 등 일명 가설 업무도 해야 하는 소대였었다. 보통 가설 작업은 소대원들에게 할당을 했고, 나는 처음과 끝에 위치하여 마무리를 확인하는 역할을 하였다. 군 부대는 여러 망이 존재하고 망별로 분리하여 사용하는 개념이기 때문에 망별 선과 케이블 색깔로 분리하였으며, 추가적으로 배열에도 차이점을 뒀었다. 이는 다음에 설명하겠다.

랜 사업을 진행하고 나면 여분의 랜 케이블들을 받았었고, 처음 부임했을 때 너무 많은 것 아니야? 라는 생각이 있었으나 소모량이 어마어마했다. 주로 CAT6 랜 케이블을 사용했었고, 5와의 차이점은 안에 심지 같은 게 있어서 랜선을 더 잘 보호하는 것 같았다. CAT

다음은 네트워크 하드웨어이다. 내가 많이 다뤄봤던 순으로 정리하였다.

1. **허브**
    - **허브**는 네트워크 장비들 간의 데이터를 단순히 전송하는 장비입니다.
    - **기능**: 모든 포트로 수신된 데이터를 브로드캐스트 방식으로 전달합니다.
    - **용도**: 스위치보다 더 간단하지만, 트래픽이 많을 경우 효율성이 떨어질 수 있습니다.
    
    멀티탭을 생각하면 좋을 것 같다. 흐르는 네트워크를 여러 기기에 분산할 수 있도록 사용한 장치이다. 허브는 주로 더미 허브와 POE 허브로 나뉘었다. POE 허브는 Power over Ethernet의 약자로 랜선에 전원까지 실어 보낼 수 있는 기술이다. 보통 사회에서는 CCTV에 주로 쓰이며, 나는 VoIP의 존재로 인해 POE 허브를 많이 사용했었다. POE 허브로 인해 루핑 등의 문제가 있었고, 간혹 어댑터의 전류를 맞추지 않아 고장 나는 경우가 있었다.
    
    허브와 공유기는 비슷하게 생겨서 혼동될 수 있는데, 허브는 단순히 연결된 장치에 브로드캐스트를 하는 분배기라 생각한다면, 공유기는 IP 할당을 자동으로 해준다는 특징이 있다.
    
    나의 경험으로 생각해보면, 어렸을 때 저 공유기(허브)처럼 생긴 장치에 선만 꽂으면 알아서 컴퓨터들이 연결되었었는데, 부대에서 일을 할 때 단순히 공유기를 연결한다고 네트워크에 접속되지 않았다. 피시마다 직접 들어가서 IP를 설정해줘야 네트워크 망이 연결되었었다.
    
2. **스위치**
    - **스위치**는 네트워크 장비로, 여러 장비를 연결하여 데이터 패킷을 목적지 장비로 효율적으로 전달합니다.
    - **기능**: 각 포트에서 수신한 데이터 패킷을 분석하여 올바른 포트로 전송합니다.
    - **용도**: LAN 내에서 장비들 간의 데이터 통신을 관리합니다.
    
    내가 갖고 있던 대부분의 장비를 차지했었다. 스위치도 여러 가지 종류가 있었다. 광 트랜시버를 꽂아서 광을 연결할 수 있는지(광에는 멀티, 싱글 모드 등으로 또 나뉜다.), POE 기능이 있는지, 스위치의 계층에 따른 분류도 달랐다. 어떤 특정 스위치는 기본 IP가 셋팅되어 들어와서 군 내부에서 사용하면 망 혼용을 일으키는 주범도 있었다. 전 세계 스위치의 점유율 90%가 시스코라고 했는데, 군에서는 10%도 안 됐다. 아니, 적어도 우리 부대는 그랬다. 스위치의 기본 설정법이나 기능에 대해서는 다음에 설명하겠다.
    
3. **라우터**
    - **라우터**는 서로 다른 네트워크를 연결하고, 데이터를 올바른 네트워크로 전송하는 장비입니다.
    - **기능**: IP 주소를 기반으로 데이터 패킷의 경로를 결정합니다.
    - **용도**: 인터넷과 내부 네트워크 간의 연결을 제공하며, 네트워크 간의 트래픽을 조절합니다.
    
    라우터는 쉽게 말하자면 외부 네트워크로의 통로입니다. 자세하게는 언급하지 못하지만, 여러 망들을 연동할 때 라우터에서 라우팅 테이블을 설정하여 연동하는 기능이 있다. 라우터의 라우팅 테이블을 잘 만져야 네트워크 안정화를 잡을 수 있었다.
    
    
---
💡 주로 다루었던 장비는 이 정도였고, 케이블에는 광, 동축, UTP로 분류해서 관리를 했었다. (이 부분은 추후에 다시 설명할 예정이다.)

재산으로 등록되어있던 장비는 대략 400~500개의 스위치, 라우터가 있었고, 실제 운용중이었던 장비는 대략 100여개 정도 되었었다. 그 중에 백본 스위치와 라우터도 있었고, 그 장비들을 직접 만져볼 수 있는 기회가 있었다. 
